In [ ]:
%pip install -q --upgrade pip
%pip install -q kagglehub[pandas-datasets]
%pip install -q matplotlib
%pip install -q numpy
%pip install -q pandas
%pip install -q plotly

Note: you may need to restart the kernel to use updated packages.
Note: you may need to restart the kernel to use updated packages.
Note: you may need to restart the kernel to use updated packages.
Note: you may need to restart the kernel to use updated packages.
Note: you may need to restart the kernel to use updated packages.

In [229]:
import kagglehub
from kagglehub import KaggleDatasetAdapter
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import plotly.express as px

In [134]:
# Set the path to the file you'd like to load
file_path = "data_science_job_posts_2025.csv"

# Load the latest version
df = kagglehub.load_dataset(
  KaggleDatasetAdapter.PANDAS,
  "elahehgolrokh/data-science-job-postings-with-salaries-2025",
  file_path,
)

list(df.columns)

C:\Users\USUARIO\AppData\Local\Temp\ipykernel_5020\236363616.py:5: DeprecationWarning: load_dataset is deprecated and will be removed in future version.
  df = kagglehub.load_dataset(

Warning: Looks like you're using an outdated `kagglehub` version (installed: 0.3.11), please consider upgrading to the latest version (0.3.13).

['job_title',
 'seniority_level',
 'status',
 'company',
 'location',
 'post_date',
 'headquarter',
 'industry',
 'ownership',
 'company_size',
 'revenue',
 'salary',
 'skills']

In [226]:
def toInt(nums):
    nums = [n.replace(",", "") for n in nums]
    nums = [int(n.replace("€", "")) for n in nums]
    return nums

def promediate(nums):
    nums = nums.split("-")
    nums = toInt(nums)
    return int(sum(nums)/len(nums))

def str_to_list(s):
    s = s.translate(str.maketrans("", "", "'[]"))
    elements = s.split(",")
    return [element.strip() for element in elements if len(elements) > 0]


def ranges(salary):
    if (salary<35000):
        return "<35000"
    elif (salary>=35000 and salary<70000):
        return "35000-70000"
    elif (salary>=70000 and salary<105000):
        return "700000-105000"
    elif (salary>=105000 and salary<140000):
        return "105000-140000"
    elif (salary>=140000 and salary<175000):
        return "140000-175000"
    elif (salary>=175000 and salary<210000):
        return "175000-210000"
    elif (salary>210000):
        return ">210000"
    else:
        return "N/A"
    
copydf = df.copy()
copydf = copydf.drop(columns=["job_title","company","post_date","revenue"])
copydf["salary"] = copydf["salary"].apply(promediate)
copydf["salary_range"] = copydf["salary"].apply(ranges)
copydf[["seniority_level","status","salary_range","skills"]]
copydf

,seniority_level,status,location,headquarter,industry,ownership,company_size,salary,skills,salary_range
0,senior,hybrid,"Grapevine, TX . Hybrid","Bentonville, AR, US",Retail,Public,€352.44B,150705,"['spark', 'r', 'python', 'scala', 'machine lea...",140000-175000
1,lead,hybrid,"Fort Worth, TX . Hybrid","Detroit, MI, US",Manufacturing,Public,"155,030",118733,"['spark', 'r', 'python', 'sql', 'machine learn...",105000-140000
2,senior,on-site,"Austin, TX . Toronto, Ontario, Canada . Kirkla...","Redwood City, CA, US",Technology,Public,"25,930",127273,"['aws', 'git', 'python', 'docker', 'sql', 'mac...",105000-140000
3,senior,hybrid,"Chicago, IL . Scottsdale, AZ . Austin, TX . Hy...","San Jose, CA, US",Technology,Public,"34,690",153599,"['sql', 'r', 'python']",140000-175000
4,NaN,on-site,On-site,"Stamford, CT, US",Finance,Private,"1,800",171254,[],140000-175000
...,...,...,...,...,...,...,...,...,...,...
939,senior,NaN,"Bengaluru, Karnataka, India","Armonk, NY, US",Technology,Public,"524,598",43184,"['pytorch', 'python', 'sql', 'machine learning...",35000-70000
940,senior,NaN,"Melbourne, Victoria, Australia","Seattle, WA, US",Retail,Public,"865,456",64290,"['amazon', 'machine learning']",35000-70000
941,midlevel,on-site,"McLean, VA","McLean, VA, US",Retail,Public,"55,150",156207,"['spark', 'aws', 'r', 'python', 'scala', 'sql'...",140000-175000
942,midlevel,on-site,"New York, NY","McLean, VA, US",Retail,Public,"55,110",170372,"['spark', 'aws', 'r', 'python', 'scala', 'sql'...",140000-175000
943,senior,on-site,"San Diego, CA","Mountain View, CA, US",Technology,Public,"17,040",198706,"['r', 'python', 'scala', 'sql', 'machine learn...",175000-210000

In [ ]:
skillCount = copydf[["seniority_level","skills"]]
skillCount["skills"] = skillCount["skills"].apply(str_to_list)
skillCount = skillCount.explode("skills").value_counts().reset_index()
skillCount

df = px.data.iris() 

# plotting the bar chart
fig = px.bar(df, x="sepal_width", y="sepal_length") 

fig.show()

C:\Users\USUARIO\AppData\Local\Temp\ipykernel_5020\3059166521.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  skillCount["skills"] = skillCount["skills"].apply(str_to_list)

    seniority_level            skills  count
0            senior            python    451
1            senior  machine learning    395
2            senior               sql    315
3            senior                 r    244
4            senior               aws    158
..              ...               ...    ...
112            lead            docker      1
113          junior           airflow      1
114        midlevel           powerbi      1
115        midlevel              bash      1
116        midlevel             keras      1

[117 rows x 3 columns]